## Staging: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
[0;90m16:26:40.590[0m [0;37mSTDOUT[0m [0;36mterraform: [0mecr.tf
```
```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                NAME                |
|--------|------------------------------------|
| add    | `aws_ecr_repository.react_answers` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_ecr_repository.react_answers will be created
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_ecr_repository" "react_answers" {
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                  = (known after apply)
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                   = (known after apply)
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + image_tag_mutability = "MUTABLE"
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                 = "react-answers"
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + registry_id          = (known after apply)
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + repository_url       = (known after apply)
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all             = (known after apply)
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + image_scanning_configuration {
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + scan_on_push = true
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m16:26:44.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 1 to add, 0 to change, 0 to destroy.
[0;90m16:26:44.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m16:26:44.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ecr_repository_arn = (known after apply)
[0;90m16:26:44.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ecr_repository_url = (known after apply)
[0;90m16:26:44.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m16:26:44.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m16:26:44.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m16:26:44.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.react_answers"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
